{
  "backend/main.mo": "Main Motoko actor implementing user profiles, business cards, saved content, bookmarks, ideas, and reminders with access control authorization checks on all public functions.",
  "feature_evidence.json": "Feature evidence report documenting implementation of page transitions, micro-interactions, staggered list animations, and modal dialog animations across frontend components.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their animation implementations, component behaviors, and styling enhancements.",
  "frontend/index.css": "Tailwind CSS configuration with CSS custom properties for light/dark theme variables including colors, borders, and component-specific styling tokens.",
  "frontend/index.html": "HTML entry point for the CardVault React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component managing authentication flow, profile setup dialog, and conditional rendering of SignInPage or AppLayout with theme provider and toast notifications.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component with interactive scale and press animations that handles Internet Identity login/logout and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog with scale-in animation for initial user profile setup, collecting name and optional email with focus ring animations on inputs.",
  "frontend/src/components/content/BookmarkForm.tsx": "Dialog form with scale-in animation for creating and editing bookmarks using ContentType enum, with focus ring animations and button press feedback.",
  "frontend/src/components/content/SavedContentForm.tsx": "Dialog form component for creating and editing saved content items (links or text) with tabs, title/URL/text inputs, and integration with create/update mutations.",
  "frontend/src/components/empty-states/EmptyState.tsx": "Reusable empty state component that displays an image, title, and description for empty data scenarios.",
  "frontend/src/components/ideas/IdeaForm.tsx": "Dialog form component for creating and editing ideas with a textarea input and integration with create/update mutations.",
  "frontend/src/components/layout/AppLayout.tsx": "Main layout component that manages navigation state and renders different page components (BusinessCard, SavedContent, Bookmarks, Ideas, Reminders) based on active section.",
  "frontend/src/components/layout/BottomNav.tsx": "Fixed bottom navigation bar with five sections (Card, Content, Links, Ideas, Tasks) using icons and active state styling.",
  "frontend/src/components/layout/Header.tsx": "Sticky header component displaying the current section title with icon, user profile name, and login button.",
  "frontend/src/components/loading/SkeletonLoader.tsx": "Collection of skeleton loading components (SkeletonCard, SkeletonList, SkeletonForm) for displaying loading states.",
  "frontend/src/components/reminders/ReminderForm.tsx": "Dialog form component for creating and editing reminders with content textarea, optional due date/time inputs, and integration with create/update mutations.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing AuthClient creation, login/logout flow, identity state, and login status tracking.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for managing user profiles, business cards, saved content, ideas, and reminders with CRUD operations. Includes mutations with toast notifications and automatic query invalidation on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens using OKLCH color space for light/dark themes, typography styles, and utility classes for animations and micro-interactions.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/BookmarksPage.tsx": "Displays a list of saved bookmarks with add, edit, and delete functionality, showing empty state when no bookmarks exist and using skeleton loaders during data fetching.",
  "frontend/src/pages/BusinessCardPage.tsx": "Manages digital business card creation and editing with form fields for name, title, contact info, and bio, displaying empty state for new users and read-only view when not editing.",
  "frontend/src/pages/IdeasPage.tsx": "Lists user ideas with timestamps, providing add, edit, and delete operations, empty state for new users, and staggered animation for list items.",
  "frontend/src/pages/RemindersPage.tsx": "Displays reminders organized into tabs (upcoming, overdue, completed) with functionality to create, edit, delete, and toggle completion status. Uses React Query hooks for data fetching and mutations.",
  "frontend/src/pages/SavedContentPage.tsx": "Manages general saved content (links and text snippets) with create, edit, and delete operations. Filters content by ContentType.general and displays empty state when no content exists.",
  "frontend/src/pages/SignInPage.tsx": "Landing page for unauthenticated users featuring Internet Identity sign-in with CardVault branding and loading states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining the design system including custom colors (HSL-based theme variables), typography, shadows, animations, and responsive container settings.",
  "project_state.json": "Project metadata documenting implemented features including Internet Identity authentication, business card storage, saved content, bookmarks, ideas/notes, in-app reminders, and mobile-first navigation structure."
}