{
  "backend/main.mo": "Main Motoko actor implementing user profiles, business cards, saved content, ideas, and reminders with role-based access control. Includes a public endpoint getBusinessCardByPrincipal for unauthenticated business card retrieval.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: shareable business card URLs with a Share button, a public business card view page, and copy-to-clipboard functionality with visual feedback.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend files including routing logic for public card pages, React Query hooks for backend operations, animated UI components, and utility functions for URL parameter parsing.",
  "frontend/index.css": "Tailwind CSS configuration with design tokens for light and dark themes, including color variables for UI elements, charts, and sidebar components using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the CardVault React application with viewport configuration and module script reference.",
  "frontend/src/App.tsx": "Root application component handling authentication flow, profile setup, and routing logic that detects public card routes to render PublicBusinessCardPage without authentication.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button component managing Internet Identity login/logout with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Modal dialog for initial user profile setup requiring name and optional email, with form validation and animated entrance.",
  "frontend/src/components/content/BookmarkForm.tsx": "Dialog form component for creating and editing bookmarks with title and URL fields, using ContentType enum and mutation hooks.",
  "frontend/src/components/content/SavedContentForm.tsx": "Dialog form component for creating and editing saved content items with tabs for link or text input, using React Query mutations for create/update operations.",
  "frontend/src/components/empty-states/EmptyState.tsx": "Reusable empty state component that displays an image, title, and description with fade-in and float animations.",
  "frontend/src/components/ideas/IdeaForm.tsx": "Dialog form component for creating and editing ideas with a textarea input, using React Query mutations for persistence.",
  "frontend/src/components/layout/AppLayout.tsx": "Main application layout component that manages navigation state and renders different pages (BusinessCard, SavedContent, Bookmarks, Ideas, Reminders) with header and bottom navigation.",
  "frontend/src/components/layout/BottomNav.tsx": "Fixed bottom navigation bar with five sections (Card, Content, Links, Ideas, Tasks) using icons and active state styling.",
  "frontend/src/components/layout/Header.tsx": "Sticky header component displaying the current section title with icon, user profile name, and login button.",
  "frontend/src/components/loading/SkeletonLoader.tsx": "Collection of skeleton loading components (SkeletonCard, SkeletonList, SkeletonForm) for displaying placeholder UI during data fetching.",
  "frontend/src/components/reminders/ReminderForm.tsx": "Dialog form component for creating and editing reminders with content, optional due date/time fields, and React Query mutations for persistence.",
  "frontend/src/components/share/ShareCardDialog.tsx": "Dialog component for sharing business card URLs with copy-to-clipboard functionality and toast notifications.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with Internet Identity authentication, creating authenticated or anonymous actors and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing user profiles, business cards, saved content, ideas, and reminders with CRUD operations and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens (colors, spacing), utility classes for animations and interactions, and keyframe definitions for fade/slide/scale effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/BookmarksPage.tsx": "Page component for displaying, creating, editing, and deleting bookmarks with empty states, loading skeletons, and a modal form interface.",
  "frontend/src/pages/BusinessCardPage.tsx": "Page component for creating and editing a digital business card with form fields for contact information, sharing functionality, and empty/loading states.",
  "frontend/src/pages/IdeasPage.tsx": "Displays a list of user ideas with create, edit, and delete functionality, including loading states, empty states, and formatted timestamps.",
  "frontend/src/pages/PublicBusinessCardPage.tsx": "Public-facing page that displays a business card by principal ID from the URL, with error handling for invalid or missing cards.",
  "frontend/src/pages/RemindersPage.tsx": "Manages reminders with tabs for upcoming, overdue, and completed items, supporting create, edit, delete, and toggle completion actions.",
  "frontend/src/pages/SavedContentPage.tsx": "Displays saved content items (links and text snippets) with CRUD operations, filtering for general content type only.",
  "frontend/src/pages/SignInPage.tsx": "Landing page with Internet Identity authentication, displaying the CardVault logo and sign-in button with loading state.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting URL parameters and detecting public card routes, including principal ID extraction from pathname.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including colors, shadows, animations, and typography plugin integration.",
  "project_state.json": "Project state tracking document defining a mobile-friendly web app for digital business cards with links, bookmarks, ideas, and in-app reminders. Contains 8 implemented features including Internet Identity authentication, persistent storage for user-scoped data, and mobile-first navigation with a distinctive visual theme."
}