{
  "kind": "build_request",
  "title": "Add business card sharing via link",
  "projectName": "CardVault",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-17",
      "text": "Add a public query endpoint to the backend that retrieves a user's business card by their principal ID, allowing unauthenticated access for sharing purposes",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "بله دیگه."
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a public query function that accepts a principal ID and returns the associated business card data",
        "The function returns an optional result (null if no card exists for that principal)",
        "No authentication is required to call this endpoint"
      ]
    },
    {
      "id": "REQ-18",
      "text": "Add a 'Share' button to the BusinessCardPage that generates and displays a shareable URL containing the user's principal ID",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "بله دیگه."
        ]
      },
      "acceptanceCriteria": [
        "A share button appears on the business card page when the user has created their card",
        "Clicking the button generates a URL with the user's principal ID as a parameter",
        "The URL is displayed in a dialog or modal for easy copying",
        "Button includes appropriate icon (share/link icon)"
      ]
    },
    {
      "id": "REQ-19",
      "text": "Create a public business card view page that displays a read-only version of any user's business card when accessed via the sharing URL",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "بله دیگه."
        ]
      },
      "acceptanceCriteria": [
        "A new route or page component handles shared card URLs",
        "The page extracts the principal ID from the URL parameters",
        "The page fetches and displays the business card data using the public query endpoint",
        "The view is read-only with no edit functionality",
        "Shows appropriate message if the card does not exist or fails to load",
        "Maintains the app's visual theme and responsive design"
      ]
    },
    {
      "id": "REQ-20",
      "text": "Add copy-to-clipboard functionality with visual feedback when the user copies their shareable business card link",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-final"
        ],
        "quotes": [
          "بله دیگه."
        ]
      },
      "acceptanceCriteria": [
        "A copy button appears next to or within the shareable URL display",
        "Clicking the copy button copies the URL to the system clipboard",
        "Visual feedback appears (toast notification, button state change, or checkmark animation) confirming successful copy",
        "The interaction follows the app's existing micro-interaction patterns"
      ]
    }
  ],
  "constraints": [
    "Do not modify the existing backend stable state structure for user profiles or business cards",
    "Do not change the existing authentication flow or Internet Identity integration",
    "Maintain the single-actor backend architecture",
    "The shared card view must not require authentication to access"
  ],
  "nonGoals": [
    "Sharing other user data types (saved content, bookmarks, ideas, reminders)",
    "Social media integration or direct sharing to platforms",
    "QR code generation for business cards",
    "Analytics or tracking of card views",
    "Custom vanity URLs or short links",
    "Editing capabilities on the shared card view"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}