{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add business card sharing via link - Frontend",
  "requirements": [
    {
      "id": "REQ-18",
      "summary": "Add a 'Share' button to BusinessCardPage that generates and displays a shareable URL with the user's principal ID",
      "acceptanceCriteria": [
        "A share button appears on the business card page when the user has created their card",
        "Clicking the button generates a URL with the user's principal ID as a parameter",
        "The URL is displayed in a dialog or modal for easy copying",
        "Button includes appropriate icon (share/link icon)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/BusinessCardPage.tsx",
          "operation": "modify",
          "description": "Add a share button that appears when a business card exists (after the Edit button in read-only mode). The button opens a dialog displaying the shareable URL. Generate the URL using window.location.origin plus a route path with the user's principal ID as a parameter. Use the useInternetIdentity hook to access the current user's principal. Include a Share icon (lucide-react) on the button."
        },
        {
          "path": "frontend/src/components/share/ShareCardDialog.tsx",
          "operation": "create",
          "description": "Create a dialog component that displays the shareable business card URL. The dialog receives the generated URL as a prop and displays it in a read-only input field. Include a copy button next to the URL input. Use shadcn/ui Dialog, Input, and Button components with consistent styling matching the app's design system. The dialog should have scale-in animation matching ProfileSetupDialog patterns."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Create a public business card view page displaying read-only cards accessed via sharing URL",
      "acceptanceCriteria": [
        "A new route or page component handles shared card URLs",
        "The page extracts the principal ID from the URL parameters",
        "The page fetches and displays the business card data using the public query endpoint",
        "The view is read-only with no edit functionality",
        "Shows appropriate message if the card does not exist or fails to load",
        "Maintains the app's visual theme and responsive design"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/PublicBusinessCardPage.tsx",
          "operation": "create",
          "description": "Create a standalone page component that displays a shared business card in read-only mode. Extract the principal ID from URL parameters (use frontend/src/utils/urlParams.ts utility). Call the getBusinessCardByPrincipal backend method using useActor hook. Display the card data in the same visual layout as BusinessCardPage but without edit/share buttons. Show SkeletonLoader during loading. Display EmptyState component if the card doesn't exist or fails to load. Include CardVault branding/logo at the top. Use Tailwind styling consistent with the app theme. This page does not require authentication and should work for anonymous users."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add routing logic to detect and render PublicBusinessCardPage when the URL contains the shared card route pattern. Check URL parameters early in the component (before authentication checks) to identify shared card access. When a shared card URL is detected, render PublicBusinessCardPage directly without requiring authentication or profile setup. Maintain existing authentication flow for normal app access."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query hook useGetBusinessCardByPrincipal that accepts a Principal parameter and calls actor.getBusinessCardByPrincipal(principal). This hook should not require authentication and should handle the public query scenario. Return the query object with loading, error, and data states."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Add copy-to-clipboard functionality with visual feedback for shareable business card links",
      "acceptanceCriteria": [
        "A copy button appears next to or within the shareable URL display",
        "Clicking the copy button copies the URL to the system clipboard",
        "Visual feedback appears (toast notification, button state change, or checkmark animation) confirming successful copy",
        "The interaction follows the app's existing micro-interaction patterns"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/share/ShareCardDialog.tsx",
          "operation": "modify",
          "description": "Implement copy-to-clipboard functionality in the ShareCardDialog component. Use navigator.clipboard.writeAPI to copy the URL. Add visual feedback using a toast notification (useToast from existing patterns) displaying 'Link copied to clipboard!' on success. Include button state change showing a checkmark icon briefly after successful copy, then reverting to the copy icon. Apply button press animation matching existing micro-interaction patterns from the app."
        }
      ]
    }
  ]
}